-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: libris
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `user_profiles`
--

DROP TABLE IF EXISTS `user_profiles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_profiles` (
  `user_id` bigint NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `first_name` varchar(50) NOT NULL,
  `last_name_kana` varchar(50) NOT NULL,
  `first_name_kana` varchar(50) NOT NULL,
  `postal_code` varchar(10) NOT NULL,
  `prefecture` varchar(50) NOT NULL,
  `city` varchar(50) NOT NULL,
  `town` varchar(50) NOT NULL,
  `address_number` varchar(50) NOT NULL,
  `building` varchar(50) DEFAULT NULL,
  `birthday` date NOT NULL,
  `phone_number` varchar(15) DEFAULT NULL,
  `email` varchar(191) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`),
  CONSTRAINT `fk_user_profiles` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_profiles`
--

LOCK TABLES `user_profiles` WRITE;
/*!40000 ALTER TABLE `user_profiles` DISABLE KEYS */;
INSERT INTO `user_profiles` VALUES (1,'佐藤','太郎','サトウ','タロウ','8925241','愛知県','横浜市神奈川区','赤坂','5-4-17','パークマンション891','1987-02-14','08080724587','user01@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(2,'鈴木','花子','スズキ','ハナコ','8987711','千葉県','横浜市西区','西新宿','4-7-23',NULL,'2004-04-23','08077010555','user02@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(3,'高橋','健太','タカハシ','ケンタ','2199457','愛知県','福岡市中央区','南幸','2-1-6',NULL,'1997-05-22','08037605245','user03@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(4,'田中','彩花','タナカ','アヤカ','7957503','埼玉県','中央区','西新宿','1-9-5','サンライズマンション715','1987-06-23','08086671325','user04@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(5,'伊藤','涼太','イトウ','リョウタ','8524534','愛知県','大阪市北区','道玄坂','4-2-12','スカイマンション205','1993-11-21','07041152311','user05@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(6,'渡辺','春菜','ワタナベ','ハルナ','1452365','愛知県','横浜市神奈川区','梅田','1-7-2',NULL,'1999-03-04','08086655515','user06@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(7,'山本','翔太','ヤマモト','ショウタ','8900528','千葉県','横浜市神奈川区','栄','3-1-27',NULL,'1997-01-20','08054259753','user07@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(8,'中村','美優','ナカムラ','ミユ','2330848','福岡県','港区','日本橋','3-4-23','パークマンション420','1993-12-10','07037757774','user08@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(9,'小林','大輝','コバヤシ','ダイキ','9728717','愛知県','横浜市神奈川区','梅田','1-10-28','パークマンション339','2004-05-06','07026879493','user09@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(10,'加藤','結衣','カトウ','ユイ','5500098','神奈川県','横浜市神奈川区','道玄坂','5-7-18',NULL,'1984-03-15','08022592246','user10@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(11,'佐々木','蒼太','ササキ','ソウタ','1662921','大阪府','中央区','天神','2-5-7','サンライズマンション869','2001-03-11','08039702259','user11@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(12,'山田','光','ヤマダ','ヒカリ','3613435','東京都','中央区','西新宿','3-4-3',NULL,'2000-02-14','08062188093','user12@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(13,'清水','大河','シミズ','タイガ','8399384','神奈川県','豊島区','赤坂','4-3-19','スカイマンション124','1986-04-10','09074669292','user13@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(14,'吉田','美玖','ヨシダ','ミク','4887957','大阪府','港区','天神','2-3-17',NULL,'1997-11-26','08011420763','user14@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(15,'山口','廉','ヤマグチ','レン','8799979','福岡県','福岡市中央区','反町','1-5-9','グリーンマンション342','1995-02-06','07093301684','user15@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(16,'松本','莉子','マツモト','リコ','9050212','埼玉県','名古屋市中区','道玄坂','4-9-10',NULL,'1983-12-16','08002452774','user16@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(17,'井上','優太','イノウエ','ユウタ','4010475','埼玉県','横浜市西区','道玄坂','2-6-30','グリーンマンション688','1984-03-08','09011055776','user17@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(18,'木村','陽菜','キムラ','ヒナ','1094953','愛知県','横浜市西区','日本橋','4-3-27','パークマンション855','2002-07-22','08056249568','user18@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(19,'林','拓海','ハヤシ','タクミ','1383408','愛知県','中央区','梅田','2-11-20',NULL,'2001-01-08','09057950757','user19@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(20,'斉藤','芽衣','サイトウ','メイ','6453467','埼玉県','港区','池袋','2-8-6','パークマンション348','1998-07-09','09022468706','user20@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(21,'森','陽斗','モリ','ハルト','8789724','福岡県','港区','道玄坂','2-12-25','グリーンマンション195','1981-04-05','08026478790','user21@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(22,'阿部','紗良','アベ','サラ','9057779','福岡県','横浜市神奈川区','日本橋','1-9-16',NULL,'1996-09-17','09095233011','user22@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(23,'橋本','義樹','ハシモト','ヨシキ','7561387','大阪府','大阪市北区','池袋','2-6-26','パークマンション629','1989-03-18','09033083447','user23@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(24,'石原','佳奈','イシハラ','カナ','6688338','埼玉県','港区','日本橋','2-2-12','グリーンマンション209','1992-12-25','09070059909','user24@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(25,'三浦','航輝','ミウラ','コウキ','9545304','愛知県','渋谷区','赤坂','2-5-21','スカイマンション703','2000-08-12','09043954794','user25@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(26,'福田','桃花','フクダ','モモカ','4829904','大阪府','横浜市西区','赤坂','4-8-17',NULL,'1990-01-07','07026056733','user26@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(27,'岡本','斗真','オカモト','トウマ','5141808','神奈川県','福岡市中央区','赤坂','3-4-14',NULL,'1987-11-06','09086630199','user27@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(28,'上田','七海','ウエダ','ナナミ','1627600','東京都','大阪市北区','南幸','3-4-22','サンライズマンション651','1997-12-19','08062962535','user28@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(29,'村上','隼人','ムラカミ','ハヤト','5060785','神奈川県','横浜市神奈川区','南幸','4-12-4',NULL,'2000-04-09','07090612125','user29@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(30,'太田','葵','オオタ','アオイ','2066332','神奈川県','中央区','梅田','1-1-3','スカイマンション438','1993-02-15','09022779931','user30@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(31,'金子','悠斗','カネコ','ユウト','5313689','愛知県','横浜市西区','道玄坂','2-8-19','パークマンション356','1987-01-22','07032149413','user31@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(32,'藤井','瑠奈','フジイ','ルナ','8329380','埼玉県','横浜市西区','道玄坂','2-9-30','サンライズマンション820','1994-10-07','09041886355','user32@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(33,'石井','湊','イシイ','ミナト','6076945','千葉県','新宿区','道玄坂','1-2-4','スカイマンション302','1985-10-28','09080835229','user33@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(34,'遠藤','乃愛','エンドウ','ノア','6190193','福岡県','豊島区','道玄坂','4-1-28',NULL,'2001-03-26','09014675127','user34@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(35,'青木','琉生','アオキ','リュウセイ','7530914','大阪府','名古屋市中区','南幸','4-11-21','グリーンマンション274','1992-04-23','07037511737','user35@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(36,'中島','日菜','ナカジマ','ヒナ','5599728','埼玉県','横浜市西区','栄','5-12-9','サンライズマンション843','2003-02-28','09017227627','user36@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(37,'坂本','結人','サカモト','ユイト','1585388','神奈川県','中央区','道玄坂','1-10-27','グリーンマンション446','1992-06-14','07056413908','user37@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(38,'前田','桜','マエダ','サクラ','6980939','埼玉県','中央区','池袋','4-11-18',NULL,'1989-02-13','07033284252','user38@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(39,'横山','惠太','ヨコヤマ','ケイタ','4960717','福岡県','中央区','反町','4-3-1',NULL,'2004-01-24','09003762444','user39@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(40,'長谷川','美桜','ハセガワ','ミオ','9962410','千葉県','中央区','西新宿','1-6-10','パークマンション534','1983-03-06','09091372082','user40@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(41,'小松','大成','コマツ','タイセイ','7437478','福岡県','名古屋市中区','西新宿','1-2-8','スカイマンション785','1988-04-21','09085267109','user41@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(42,'竹内','ひより','タケウチ','ヒヨリ','5744370','大阪府','横浜市西区','栄','5-1-18',NULL,'1995-09-15','07042706259','user42@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(43,'柴田','凛','シバタ','リン','7400787','福岡県','港区','道玄坂','2-10-16','サンライズマンション310','1994-04-07','08003476097','user43@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(44,'平野','篤輝','ヒラノ','アツキ','4139342','東京都','福岡市中央区','栄','5-7-12',NULL,'1993-05-25','07030388324','user44@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(45,'久保','由良','クボ','ユラ','4037482','大阪府','渋谷区','西新宿','3-9-9','サンライズマンション115','1992-03-24','08066959477','user45@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(46,'和田','淳','ワダ','ジュン','3830067','東京都','横浜市神奈川区','道玄坂','3-4-29','サンライズマンション517','1985-05-18','07091345949','user46@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(47,'高田','小春','タカダ','コハル','9524218','大阪府','大阪市北区','栄','1-5-10',NULL,'1986-01-18','07018051418','user47@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(48,'川口','星也','カワグチ','セイヤ','5125515','愛知県','福岡市中央区','梅田','5-1-5',NULL,'1998-08-14','08086492833','user48@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(49,'栗原','美咲','クリハラ','ミサキ','7108712','東京都','港区','池袋','4-10-16',NULL,'1991-06-28','08048037255','user49@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58'),(50,'永井','翼','ナガイ','ツバサ','6427571','福岡県','福岡市中央区','西新宿','1-11-22','パークマンション435','1998-04-28','08038537488','user50@example.com','2025-11-27 13:09:58','2025-11-27 13:09:58');
/*!40000 ALTER TABLE `user_profiles` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-12-09 13:06:57
